#### EnergyModelType Enumeration

---

|  |
| --- |
| See Also |

This enum is used to define if the energy model is based on rooms/spaces, building elements or analysis mode in EnergyDataSettings.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public enum EnergyModelType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration EnergyModelType ``` |

| Visual C++ |
| --- |
| ``` public enum class EnergyModelType ``` |

# Members

| Member name | Description |
| --- | --- |
| SpatialElement | Energy model based on rooms or spaces. |
| BuildingElement | The building element based energy analytical model. |
| AnalysisMode | Energy model based on analysis mode in EnergyDataSettings. |

# See Also

Autodesk.Revit.DB.Analysis Namespace